Repository: nahom-habtamu/myshiyach_mobile_client
Catalog: lib/l10n/app_*.arb
Languages: am

# language
source: English
am: አማርኛ

# appTitle
source: My Shiyach
am: ማይ ሽያጭ

# addPostAppBarText
source: Add Post
am: እቃ ለጥፍ

# addPostEmptyCategories
source: Empty Categories
am: ባዶ መደቦች

# addPostButtonCancelText
source: Cancel
am: ተመለስ

# addPostButtonPostText
source: Post
am: ለጥፍ

# addPostButtonNextText
source: Next
am: ቀጥል

# addPostNoImageWarning
source: Please Pick Product Images
am: እባክዎን የእቃውን ፎቶዎች ያስገቡ

# changePasswordIntroHeaderOne
source: Change Your Password?
am: ምስጢር ቁጥር ቀይር?

# changePasswordIntroHeaderTwo
source: Type in your new password here .
am: አዲሱን ሚስጥር ቁጥር አስገባ .

# changePasswordInputHint
source: Password
am: ሚስጥር ቁጥር

# changePasswordRepeatInputHint
source: Password Repeat
am: ሚስጥር ቁጥር ይድገሙ

# changePasswordInputValidationEmptyText
source: Please Enter Password
am: ሚስጥር ቁጥር ያስገቡ

# changePasswordInputValidationTooShortText
source: Please Enter 6 or more characters
am: ከ 8 ፊደል የበለጠ ሚስጥር ቁጥር ያስገቡ

# changePasswordInputValidationNotMatchText
source: Passwords Don't Match
am: ሚስጥር ቁጥሩ አንድ አይደለም

# changePasswordErrorText
source: Change Password Failed!!!
am: ሚስጥር ቁጥር መቀየር አልተሳካም!!!

# changePasswordButtonText
source: Change Password
am: ሚስጥር ቁጥር ቀይር

# chatDetailAppBarText
source: Chat Detail
am: የውይይት ዝርዝር

# chatDetailMessageInputHint
source: Send Message
am: መልእክት ላክ

# chatDetailFetchError
source: Error In Fetching Messages
am: መልእክቶችን ማምጣት አልተቻለም

# chatListAppBarText
source: Chat List
am: ውይይቶች

# chatListFetchFailedError
source: Something went wrong
am: ውይይቶችን ማግኘት አልተቻለም

# chatListFetchEmpty
source: No chats found!!
am: ምንም ውይይቶች የለዎትም!!

# chatListFetchLoadingText
source: Loading...
am: ትንሽ ይጠብቁ

# commonMainCategoryInputHintText
source: Category
am: ዋና መደቦች

# commonMainCategoryInputEmptyText
source: Please Select Main Category
am: ዋና መደብ ይምረጡ

# commonSubCategoryInputHintText
source: Sub Category
am: ንኡስ መድቦች

# commonSubCategoryInputEmptyText
source: Please Select Sub Category
am: ንኡስ መደብ ይምረጡ

# commonTitleInputHintText
source: Title
am: ርእስ

# commonTitleInputEmptyText
source: Please Enter Title
am: ርእስ ያስገቡ

# commonDescriptionInputHintText
source: Description
am: ተጨማሪ ማብራሪያ

# commonDescriptionInputEmptyText
source: Please Enter Description
am: ተጨማሪ ማብራሪያ ያስገቡ

# commonPriceInputHintText
source: Price
am: ዋጋ

# commonPriceInputEmptyText
source: Please Enter Price
am: የእቃውን ዋጋ ያስገቡ

# commonPriceInputIncorrectError
source: Enter Correct Price
am: ትክክለኛ ዋጋ ያስገቡ

# commonPickImagesInputHintText
source: Pick Images
am: ፎቶ ይምረጡ

# commonCityInputHintText
source: City
am: ከተማ

# commonCityInputEmptyText
source: Please Enter City
am: ከተማ ይምረጡ

# commonContactPersonInputHintText
source: Contact Person
am: ስልክ ቁጥር

# commonContactPersonInputEmptyText
source: Please Enter Contact Person
am: እባክዎን ስልክ ቁጥር ያስገቡ

# commonFallBackErrorCaptionText
source: Oops
am: ችግር ተፈጥሯል

# commonFallBackErrorButtonText
source: Retry
am: እንደገና ይሞክሩ

# commonFallBackErrorHintText
source: Something went wrong in displaying data
am: ውሂብ በማሳየት ላይ የሆነ ችግር ተፈጥሯል።

# commonFallBackNoNetworkCaptionText
source: Please Connect to the internet to access our app features.
am: ኔትዎርክ ተቋርጧል

# commonFallBackNoNetworkButtonText
source: No Network
am: እንደገና ይሞክሩ ፡፡

# commonFallBackNoNetworkHintText
source: Try Again
am: እባክዎን መተግበሪያውን ለመጠቀም ከአውታር መረብ ጋር ይገናኙ ፡፡

# commonImageSendingPreviewCloseButton
source: Close
am: ዝጋ

# commonImageSendingPreviewAddButton
source: Add
am: ጨምር

# commonImageSendingPreviewSendButton
source: Send Files
am: ፎቶዎቹን ላክ

# commonImageSendingPreviewPickedFiles
source: Picked Files
am: የተመረጡ ፎቶዎች

# lazyLoaderPullUpToLoadText
source: Pull up load
am: ለመጨመር ወደላይ ይጎትቱ

# lazyLoaderLoadFailedText
source: Load Failed! Click retry!
am: እቃዎችን መጨመር አልተቻለም! እባክዎን እንደገና ይሞክሩ

# lazyLoaderReleaseToLoadMoreText
source: Release to load more
am: የጎተቱትን ሲለቁ እቃዎች ይጨመራሉ

# lazyLoaderNoMoreDataText
source: No more Data
am: ተጨማሪ እቃዎች የሉንም

# contactUsAppBarText
source: Contact Us
am: ስለ እኛ

# contactUsCallUsText
source: Call Us
am: ይደውሉ

# contactUsEmailUsText
source: Email Us
am: ኢሜይል ይጻፉልን

# contactUsAboutOurCompanyText
source: About Our Company
am: ስለ ድርጅታችን

# contactUsAboutOurProductText
source: About Our Product
am: ስለ መተግበሪያው

# contactUsAddressText
source: Address
am: አድራሻ

# contactUsCityText
source: City
am: ከተማ

# contactUsCityValueText
source: Addis Ababa
am: አዲስ አበባ

# contactUsAddressLineText
source: Address Line
am: አካባቢ

# contactUsAddressLineValueText
source: Bole Rwanda
am: ቦሌ ርዋንዳ

# contactUsSpecificAddressText
source: Specific Adress
am: ልዩ ቦታው

# editPostAppBarText
source: Edit Post
am: እቃ ማስተካከያ

# editPostSaveButtonText
source: Save Changes
am: ለውጦቹን ተግብር

# editPostError
source: Error In Editing the Product
am: እቃው ላይ ማስተካከያዎቹን መተግበር አልተቻለም

# filterAppBarText
source: Filters
am: ማጣሪያዎች

# filterMaxPriceText
source: Max Price
am: ትልቅ ዋጋ

# filterMinPriceText
source: Min Price
am: ትንሽ ዋጋ

# filterMainCategoryInputHint
source: Main Category
am: ዋና መደቦች

# filterSubCategoryInputHint
source: Sub Category
am: ንኡስ መድቦች

# filterBrandInputHint
source: Brand
am: ብራንድ

# filterCityInputHint
source: City
am: ከተማ

# filterSortByPriceText
source: Sort By Price
am: በዋጋ ቅደም ተከተል ደርድር

# filterSortByDateOfPostText
source: Sort By Date Of Post
am: በተለጠፉበት ሰአት ቅደም ተከተል ደርድ

# filterAscendingText
source: Ascending
am: ወደ ላይ

# filterDescendingText
source: Descending
am: ወደ ታች

# filterNoneText
source: None
am: ምንም

# filterRemoveButtonText
source: Remove Filters
am: ማጣሪያዎችን ደምስስ

# filterApplyButtonText
source: Apply Filters
am: ማጣሪያዎችን ተግብር

# filterModalHeaderText
source: Price Control
am: ዋጋ መቆጣጠርያ

# filterModalApplyButtonText
source: Apply
am: ተግብር

# forgotPassowordPhoneInputHintText
source: Enter Phone
am: ስልክ ቁጥር አስገባ

# forgotPassowordButtonText
source: Continue
am: ቀጥል

# forgotPassowordHeaderOne
source: Forgot Your Password ?
am: ምስጢር ቁጥር ረሱ?

# forgotPassowordHeaderTwo
source: Type Your Phone Number To Start
am: ስልክ ቁጥር በማስገባት ይጀምሩ

# forgotPasswordOtpVerifyButtonText
source: Submit
am: አረጋግጥ

# homeHeader
source: Products
am: እቃዎች

# homeSearchBarHint
source: Search Item
am: እቃ ይፈልጉ

# homeEmptyProductText
source: No Products yet Found!
am: እስካሁን ምንም እቃዎች አልተለጠፉም!

# homeRetryFetchProductButtonLabel
source: Hit The button Below Reload
am: እንደገና ለመሞከር በታች ያለውን አዝራር ይጫኑ

# homeRetryFetchProductButtonText
source: Reload
am: እንደገና ሞክር

# introPageHeaderOne
source: Easy Process
am: ቀላል ሂደት

# introPageDescriptionOne
source: Find all your needs in one place. We provide every service to make your experience smooth.
am: ሁሉንም ፍላጎቶችዎን በአንድ ቦታ ያግኙ። የእርስዎን ተሞክሮ ጥሩ ለማድረግ እያንዳንዱን አገልግሎት እናቀርባለን።

# introPageHeaderTwo
source: Expert People
am: እጅግ የሰለጠኑ ሰዎች

# introPageDescriptionTwo
source: We have the best in class individuals working just for you. They are well trained and capable of handling anything you need.
am: ለእርስዎ ብቻ የሚሰሩ ፣ በደንብ የሰለጠኑ እና የሚፈልጉትን ማንኛውንም ነገር የማስተናገድ ችሎታ አላቸው።

# introPageHeaderThree
source: Appreciation
am: አድናቆት

# introPageDescriptionThree
source: You will get what you need , therefore you will be satisfied
am: የሚፈልጉትን ያገኛሉ, ስለዚህ እርስዎም ደስ ይሰኛሉ

# introPageSkipButtonText
source: Skip
am: እለፍ

# introPageNextButtonText
source: Next
am: ቀጣይ

# loginPageHeaderOne
source: Let's Start Shopping
am: አሁን መገበያየት ልንጀምር ነው

# loginPageHeaderTwo
source: Login to start using the app
am: መተግበሪያውን መጠቀም ለመጀመር ማነነትዎን ያረጋግጡ

# loginPhoneNumberHint
source: Enter Phone
am: ስልክ ቁጥር አስገባ

# loginPhoneNumberError
source: Invalid PhoneNumber
am: ያልተፈቀደ ስልክ ቁጥር

# loginPasswordHint
source: Password
am: ምስጢር ቁጥር

# loginPasswordEmptyError
source: Enter Password
am: ምስጢር ቁጥር አስገባ

# loginPasswordTooShortError
source: Please Enter 6 or more characters
am: ከ 8 ፊደል የበለጠ ሚስጥር ቁጥር ያስገቡ

# loginForgotPasswordText
source: Forgot Password ?
am: ሚስጥር ቁጥር ረሱ ?

# loginDontHaveAccountText
source: Don't Have an Account ?
am: መለያ የለዎትም ?

# loginSignUpText
source: Sign Up
am: መለያ ፍጠሩለኝ

# loginButtonText
source: Login
am: አረጋግጥ

# masterNavigationBarTextOne
source: Home
am: መነሻ

# masterNavigationBarTextTwo
source: Chat
am: ውይይት

# masterNavigationBarTextThree
source: Add Post
am: እቃ ለጥፍ

# masterNavigationBarTextFour
source: Saved
am: የተቀመጡ

# masterNavigationBarTextFive
source: Settings
am: መገለጫ

# myPostsPageAppBarText
source: My Posts
am: የኔ እቃዎች

# myPostsPageEmptyCaptionText
source: No Products yet!
am: ምንም እቃዎች የለዎትም!

# myPostsPageEmptyHintText
source: Experience Adding products by cliking the button Below
am: ከዚህ በታች ያለውን አዝራር በመጫን እቃዎችን ይለጥፉ

# myPostsPageEmptyButtonText
source: Go To Add
am: ወደ እቃ መለጥፍ ሂድ

# myPostsPageSwipeToDelete
source: Swipe To Delete
am: ለማጥፋት ከግራ ወደ ቀኝ ያንሸራትቱ

# otpVerificationHeaderOne
source: OTP Verification
am: የኦቲፒ ማረጋገጫ

# otpVerificationHeaderTwo
source: An Authentication code has been sent to
am: የማረጋገጫ ኮድ ተልኳል

# popUpDialogTitle
source: Confirm
am: አረጋግጥ

# popUpDialogConfirmButtonText
source: CONFIRM
am: አረጋግጥ

# popUpDialogCancelButtonText
source: CANCEL
am: ዝጋ

# postConfirmationAppBarText
source: Post Confirmation
am: የእቃ ልትፍ ማረጋገጫ

# postConfirmationAdPlaced
source: Ad Placed
am: እቃዎ ተለጥፏል

# postConfirmationAdPlacedSuccessfull
source: Your ad has been Successfully placed, Our logistic team will contact with you soon. For any help, call (+251) 12345678
am: ልጥፍዎ በተሳካ ሁኔታ ተቀምጧል፣ የሎጂስቲክ ቡድናችን በቅርቡ ከእርስዎ ጋር ይገናኛል። ለማንኛውም እርዳታ (+251) 12345878 ይደውሉ

# postConfirmationGoToHomePageButtonText
source: Go to Homepage
am: ወደ መነሻ ገጽ ሂድ

# postsCreatedByUserPageAppBarText
source: Posts By User
am: የተመረጡ እቃዎች

# postsCreatedByUserPageEmptyCaptionText
source: User has no products!
am: ተጠቃሚው ምንም ልጥፎች የሉትም!

# postsCreatedByUserPageEmptyHintText
source: Go to products to see more products
am: ከዚህ በታች ያለውን አዝራር በመጫን ሌሎች እቃዎችን ይመልከቱ

# postsCreatedByUserPageEmptyButtonText
source: Go To Home
am: ወደ መነሻ ገጽ ሂድ

# postsCreatedByUserPageUserInformationText
source: User Information
am: የተጠቃሚው መረጃዎች

# postsCreatedByUserPageProductText
source: Products by User
am: ልጥፎች

# postsCreatedByUserPageReportUserSuccessText
source: User Reported Successfully
am: ተጠቃሚውን ለአስተዳደሮች ጠቁመናል

# postDetailAppBarText
source: Post Detail
am: የእቃ ዝርዝር

# postDetailEditText
source: Edit
am: ማስተካከያ

# postDetailDeleteText
source: Delete
am: ደምስስ

# postDetailRefreshText
source: Refresh
am: አድስ

# postDetailSaveText
source: Save
am: አስቀመጥ

# postDetailShareText
source: Share
am: አጋራ

# postDetailReportText
source: Report
am: ጠቁም

# postDetailReportSuccessText
source: Product Reported To Admins
am: እቃውን ለአስተዳዳሪዎች ጠቁመናል

# postDetailRefreshError
source: Error on Refreshing Product
am: እቃውን ማደስ አልተሳካም

# postDetailDescriptionText
source: Description
am: ማብራሪያ

# postDetailTitleText
source: Title
am: ርእስ

# postDetailPriceText
source: Price
am: ዋጋ

# postDetailCityText
source: City
am: ከተማ

# postDetailStateText
source: State
am: ሁኔታ

# postDetailBrandText
source: Brand
am: ብራንድ

# postDetailCreatedAtText
source: Created
am: የተለጠፈበት ጊዜ

# postDetailRefreshedAtText
source: Last Updated
am: የታደሰበት ጊዜ

# postDetailOwnerPhoneNumberText
source: Phone No
am: ስልክ ቁጥር

# postDetailOwnerNameText
source: Name
am: የባለቤቱ ስም

# postDetailSendMessageButton
source: Send Message
am: መልእክት ይላኩ

# postDetailAddToFavoriteButton
source: Add To Favorites
am: ፌቨራይት ውስጥ አስግባ

# postDetailRemoveFromFavoriteButton
source: Remove From Favorites
am: ከፌቨራይት ውስጥ አስወጣ

# postDetailRecommendedItems
source: Recommended Items
am: የሚመከሩ እቃዎች

# postDetailBirr
source: Birr
am: ብር

# profilePageAppBarText
source: Profile
am: መገለጫ

# profilePageGeneralHeaderText
source: General
am: ጠቅላላ

# profilePagePaymentTitle
source: Payment Methods
am: የክፍያ መንገዶች

# profilePagePaymentSubTitle
source: Add your credit & debit cards
am: ክሬዲት እና ደቢት ካርድ ያስገቡ

# profilePageMyPostsTitle
source: My Posts
am: የኔ እቃዎች

# profilePageMyPostsSubTitle
source: Manage Your Posts
am: እቃዎችዎን መቆጣጠርያ

# profilePageLocationTitle
source: Locations
am: መገኛ

# profilePageLocationSubTitle
source: Add your home & work locations
am: የቤትና የመስሪያ ቤትዎን አድራሻ ያስገቡ

# profilePageAccountTitle
source: Add Social Account
am: ማህበራዊ ድረገጾች

# profilePageAccountSubTitle
source: Add Facebook, Instagram, Twitter etc
am: የፈስቡክ፣ትዊተር፣ኢንስታግራም እና ሌሎች ማህበራዊ ድረገጾችዎን ያስገቡ

# profilePageReferTitle
source: Refer to Friends
am: ለጓደኞች ያጋሩ

# profilePageReferSubTitle
source: Refer to friends for a chance of winning
am: የማሸነፍ እድል ለማግኘት ለጓደኞች ያጋሩ

# profilePageNotificationsHeaderText
source: Notifications
am: ማሳወቂያዎች

# profilePageNotificationsTitle
source: Push Notifications
am: የመተግበሪያ ማሳወቂያዎች

# profilePageNotificationsSubTitle
source: For daily update and others.
am: ለዕለታዊ ዜናዎች እና ሌሎች።

# profilePagePromotionTitle
source: Promotional Notifications
am: የማስተዋወቂያ ማሳወቂያዎች

# profilePagePromotionSubTitle
source: New Campaign & Offers
am: አዲስ አሰራሮች እና ቅናሾች

# profilePageMoreHeaderText
source: More
am: ተጨማሪ

# profilePageContactTitle
source: Contact Us
am: እኛን ማግኘት ይሻሉ?

# profilePageContactSubTitle
source: For More Information
am: ለተጨማሪ መረጃ

# profilePagePrivacyPolicyTitle
source: Privacy Policy
am: ህግና ደንቦች

# profilePagePrivacyPolicySubTitle
source: Check out applications terms and services
am: የመተግበሪያውን ህግና ደንቦች ይመልከቱ

# profilePageLanguageTitle
source: Change Language
am: ቋንቋ መቀየር

# profilePageLanguageSubTitle
source: Swap between Amharic and English Languages
am: የመተግበሪያውን ቋንቋ አማርኛ ወይም እንግሊዝኛ ቋንቋ ማድረግ ይችላሉ

# profilePageLogoutHeader
source: Logout
am: ከመተግበሪያ ውጣ

# profileLogoutPopUpHeader
source: Are you sure you want to logout?
am: ከመተግበሪያው መውጣት ይፈልጋሉ?

# savedPostsAppBarText
source: Saved Posts
am: የተቀመጡ እቃዎች

# savedPostsSwipeToDelete
source: Swipe To Delete
am: ለማጥፋት ከግራ ወደ ቀኝ ያንሸራትቱ

# savedPostsEmptyCaptionText
source: No saved Products yet!
am: ምንም የተቀመጡ እቃዎች የለዎትም!

# savedPostsEmptyHintText
source: Hit the heart icon to save a product
am: በእቃዎቹ ማሳያ ላይ ያለውን የልብ ምልክት ይንኩ

# savedPostsEmptyButtonText
source: Start Ordering
am: ወደ እቃዎቹ ዝርዝር

# savedPostsDeleteConfirmDialogText
source: Are you sure you wish to delete this item?
am: እቃውን ለመደምሰስ ይፈልጋሉ ?

# signUpPageRegisterText
source: Register
am: ይመዝገቡ

# signUpPageHeaderOne
source: Getting Started
am: መተግበሪያውን ለመጠቀም ይጀምሩ

# signUpPageHeaderTwo
source: Seems you are new here, Let's set up your profile.
am: እንኳን ወደ መተግበሪያችን መጡ፣ መገለጫዎትን እናዋቅር።

# signUpFullNameHint
source: Full Name
am: ሙሉ ስም

# signUpFullNameEmptyError
source: Please Enter FullName
am: ሙሉ ስም ያስገቡ

# signUpFullNameTooShort
source: Please Enter Your Full Name
am: ያስገቡት ሙሉ ስም እጅግ ትንሽ ነው

# signUpPasswordHint
source: Password
am: ምስጢር ቁጠር

# signUpPasswordEmptyError
source: Please Enter Password
am: ምስጢር ቁጠር ያስገቡ

# signUpPasswordTooShort
source: Please Enter 6 or more characters
am: ከ 8 ፊደል የበለጠ ሚስጥር ቁጥር ያስገቡ

# signUpPassRepeatHint
source: Confirm Password
am: ምስጢር ቁጠር ማረጋገጫ

# signUpPassRepeatEmptyError
source: Please Enter Password
am: ምስጢር ቁጠር ያስገቡ

# signUpPassRepeatTooShort
source: Please Enter 6 or more characters
am: ከ 8 ፊደል የበለጠ ሚስጥር ቁጥር ያስገቡ

# signUpPassRepeatNotMatch
source: Password Don't Match
am: ሚስጥር ቁጥሩ አንድ አይደለም

# signUpTermsAndConditionOne
source: By creating an account, you agree to our
am: መለያ በመፍጠር በእኛ ውል እና ሁኔታዎች ተስማምተሃል

# signUpTermsAndConditionError
source: You should agree with our terms to continue
am: ለመቀጠል ከውላችን ጋር መስማማት አለብዎት

# signUpAlreadyHaveAnAccount
source: Already have an account ?
am: መለያ አለዎት ?

# signInText
source: Sign In
am: ወደ ማረጋገጫ

# signUpText
source: Sign Up
am: አካውንት ፍጠር

# signUpFailedErrorMessage
source: Registration Failed
am: መለያ መፍጠር አልተሳካም

# verifyPhoneNumberButtonText
source: Continue
am: ቀጥል

# verifyPhoneNumberErrorText
source: Phone Verification Failed
am: ስልክ ቁጥር ማረጋገጥ አልተሳካም
